
# State **`s3://infrahouse-github-control-state/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        2 |           1 |          0 |
## Affected resources by action

|  Action  | Resources                                                           |
|:--------:|:--------------------------------------------------------------------|
|    🟢    | `module.repos["terraform-aws-teleport"].github_repository.repo`     |
|    🟢    | `module.repos["terraform-aws-teleport"].github_team_repository.dev` |
|    🟡    | `module.actions-runner-pem.aws_secretsmanager_secret.secret`        |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.actions-runner-pem.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/actions-runner-pem/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP",
          + "arn:aws:iam::303467602807:role/ih-tf-github-control-admin",
        ]
      + result  = (known after apply)
    }

  # module.actions-runner-pem.aws_secretsmanager_secret.secret will be updated in-place
  ~ resource "aws_secretsmanager_secret" "secret" {
        id                             = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
        name                           = "action-runner-pem-20241116182707976200000001"
      ~ tags                           = {
            "account"           = "303467602807"
            "created_by_module" = "infrahouse/secret/aws"
          ~ "environment"       = "development" -> "production"
            "owner"             = "arn:aws:iam::303467602807:role/ih-tf-github-control-admin"
            "service"           = "unknown"
        }
      ~ tags_all                       = {
          ~ "environment"       = "development" -> "production"
            # (5 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-teleport"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Module deploys a single node Teleport cluster."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "terraform-aws-teleport"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true

      + security_and_analysis (known after apply)
    }

  # module.repos["terraform-aws-teleport"].github_team_repository.dev will be created
  + resource "github_team_repository" "dev" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "terraform-aws-teleport"
      + team_id    = "7332815"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAiYWRkIjogMiwgImNoYW5nZSI6IDEsICJkZXN0cm95IjogMH19
```
</details>